Public Member Functions | Public Attributes | List of all members
API_ClassificationSystem Struct Reference
Classification Manager
Specifies a classification system. More...
#include <APIdefs_Environment.h>
 Public Member Functions
API_ClassificationSystem ()
 Public Attributes
API_Guid  | guid
The Archicad generated unique identifier of the classification system.
GS::UniString  | name
The display name of the classification system.
GS::UniString  | description
The general description of the classification system.
GS::UniString  | source
The source of the classification system (i.e. URL to a classification system standard)
GS::UniString  | editionVersion
The version string of the classification system.
GSDateRecord  | editionDate
The release date of this version of the classification system.
Detailed Description
Specifies a classification system.
Constructor & Destructor Documentation
◆ API_ClassificationSystem()
 API_ClassificationSystem::API_ClassificationSystem  |  ( |   | )
inline
Member Data Documentation
◆ description
 API_ClassificationSystem::description
The general description of the classification system.
◆ editionDate
 API_ClassificationSystem::editionDate
The release date of this version of the classification system.
◆ editionVersion
 API_ClassificationSystem::editionVersion
The version string of the classification system.
◆ guid
 API_ClassificationSystem::guid
The Archicad generated unique identifier of the classification system.
◆ name
 API_ClassificationSystem::name
The display name of the classification system.
◆ source
 API_ClassificationSystem::source
The source of the classification system (i.e. URL to a classification system standard)